[
  { "data": "Đèn PWR màu xanh báo rằng đầu đọc đang được kết nối với nguồn điện." },
  { "data": "Đèn NET màu vàng báo kết nối với mạng Ethernet trên bo mạch." },
  { "data": "Đèn STATUS màu đỏ báo kết quả NO READ trong hoạt động bình thường." },
  { "data": "Đèn COM màu vàng báo có giao tiếp đang hoạt động trên cổng serial chính; khi kết nối qua CBX500 với mạng Fieldbus, đèn này vẫn sáng do polling ngay cả khi không có dữ liệu được truyền." },
  { "data": "Đèn TRIGGER màu vàng báo trạng thái của pha đọc." },
  { "data": "Đèn GOOD màu xanh xác nhận đọc thành công." },
  { "data": "Đèn READY màu xanh báo đầu đọc đã sẵn sàng hoạt động." },
  { "data": "Trong lúc khởi động (reset hoặc restart), năm đèn LED nháy trong một giây." },
  { "data": "Có: trong chế độ Cấu hình X-PRESS, màu và ý nghĩa của các LED thay đổi theo mô tả trong phần Giao diện Người-máy X-PRESS." },
  { "data": "Nút bấm keypad mặc định khi nhấn sẽ khởi động giao diện X-PRESS để cài đặt nhanh mà không cần PC." },
  { "data": "Nhãn ví dụ trên sản phẩm cho thấy điện áp cung cấp 10–30 VDC với dòng điện khoảng 0.40–0.14 A (giá trị minh họa trên hình)." },
  { "data": "Các định danh bổ sung trên nhãn mẫu gồm kiểu máy như 'MATRIX 220 382-010', số sê-ri (ví dụ S/N COOP20345), ngày sản xuất (ví dụ September 2020) và địa chỉ MAC mẫu (ví dụ 00:07:BE:00:7C:44)." },
  { "data": "Hệ thống ngắm sử dụng hai con trỏ LED đỏ chiếu hai hình vuông cách đều lên vùng mục tiêu; mã nên được đặt giữa hai hình vuông để căn chỉnh đúng." },
  { "data": "Hai đốm LED (xanh/đỏ) có thể chiếu sáng vùng mục tiêu để báo hiệu sự kiện như Good Read hoặc No Read và sự kiện cùng cách tắt (bằng tín hiệu hoặc timeout) có thể cấu hình qua DL.CODE." },
  { "data": "ID-NET là giao diện tốc độ cao tích hợp dùng để kết nối các đầu đọc với nhau, bổ sung cho các giao diện serial Main và Auxiliary." },
  { "data": "Cấu hình 'ID-NET Synchronized' là một trạm đơn với nhiều đầu đọc đọc các mặt khác nhau của cùng một mục tiêu, cùng dùng một cảm biến presence và kích hoạt/huỷ kích hoạt đồng thời, gửi một thông điệp tổng hợp tới host cho mỗi chu kỳ." },
  { "data": "Cấu hình 'ID-NET Multidata' là nhiều trạm với các đầu đọc đơn vận hành độc lập (có thể cách xa nhau) và mỗi đầu đọc gửi dữ liệu riêng tới host sau mỗi pha đọc mà không cần bộ đaplex ngoài." },
  { "data": "Chi tiết kết nối và cấu hình cho ID-NET có trong phần 'ID-NET Interface' trang 65 và 'Internal Network Configurations' trang 138 (như được tham chiếu)." },
  { "data": "X-PRESS là một HMI trực quan dùng năm LED màu và một nút nhấn để cải thiện cài đặt và bảo trì bằng các chức năng truy cập nhanh." },
  { "data": "Nút X-PRESS cho phép truy cập các chức năng Test (biểu đồ thanh), Aim/Autofocus (bật con trỏ), Setup (hiệu chuẩn Exposure Time và Gain) và Learn (tự động nhận diện và cấu hình mã)." },
  { "data": "Để vào chức năng X-PRESS cụ thể, nhấn giữ nút cho tới khi LED của chức năng mong muốn (Test, Aim, Setup hoặc Learn) sáng, sau đó thả để vào chức năng đó." },
  { "data": "Chế độ Test hiển thị Tỷ lệ Good Read trên năm LED với các ngưỡng ≥20%, ≥40%, ≥60%, ≥75% và ≥95%; khi NO READ chỉ có đèn Status đỏ nháy." },
  { "data": "Nhấn nút X-PRESS một lần để thoát Test Mode; mặc định Test Mode tự động thoát sau ba phút." },
  { "data": "Trong Focus/Aim, con trỏ và mẫu ngắm bật để hỗ trợ định vị và lấy nét, đèn Aim nháy; nhấn nút một lần để thoát và ngắm tắt sau một thời gian ngắn." },
  { "data": "Chức năng Setup thực hiện hiệu chuẩn tham số thu ảnh cho mã được trình bày; nếu thành công tham số được lưu, LED Setup ngừng nháy và có ba tiếng bíp cao; nếu thất bại sau ~5 giây thì thoát mà không lưu, LED ngừng nháy và phát một tiếng bíp dài trầm." },
  { "data": "Chức năng Learn tự động phát hiện và nhận dạng một mã trình bày (các lần Learn kế tiếp ghi đè mã hiện tại); thành công lưu tham số xử lý/giải mã, đèn Green Spot bật, LED Learn ngừng nháy và ba tiếng bíp cao; nếu thất bại sau ~3 phút thì thoát không lưu với một tiếng bíp dài trầm." },
  { "data": "Tình trạng lỗi được báo bằng cách nháy đồng thời đèn STATUS (đỏ) và READY (xanh); chẩn đoán chi tiết có thể được bật để truyền trên các giao diện." },
  { "data": "Các lựa chọn chiếu sáng nội bộ tiêu chuẩn là 4 LED trắng, còn mẫu High Power tiêu chuẩn có 8 LED trắng cho công suất chiếu sáng gấp đôi." },
  { "data": "Các illuminator cho mẫu DPM kết hợp Top/Top Diffused và Bottom, có tùy chọn Polarized và Non-Polarized, có màu đỏ hoặc xanh dương; mẫu DPM High Power Red cung cấp gấp đôi công suất cho các loại Polarized và Non-Polarized." },
  { "data": "Mỗi kiểu máy hỗ trợ các tổ hợp chiếu sáng khác nhau: Standard White (Top+Bottom, Top, Bottom), DPM Red/Blue (Diffused Top+Bottom, Diffused Top, Diffused Bottom, Non-Polarized, Polarized), Standard High Power (Central+Top/Bottom Chain, Central Chain, Top/Bottom Chain) và DPM High Power Red (Polarized, Non-Polarized)." },
  { "data": "Đọc mọi hướng được dùng trong các ứng dụng xử lý tài liệu tự động và bưu chính sử dụng mã 2D, stacked, tuyến tính và mã bưu chính." },
  { "data": "Matrix 220 có thể đọc các mã bị biến dạng hoặc in đè, ngay cả khi hư hỏng hoặc in trên bề mặt phản chiếu hoặc vật cong." },
  { "data": "Matrix 220 đọc hiệu quả mã DPM có độ tương phản thấp do dot peen, laser hoặc ink-jet trên kim loại/PCB, bao gồm các phần tử đa-chấm và khoảng cách phần tử lớn." },
  { "data": "Sử dụng chiếu sáng màu đỏ hoặc xanh dương trên mẫu DPM giúp tối đa hóa độ tương phản khi mã hoặc nền có màu khác nhau." },
  { "data": "Với mã laser đánh dấu thời gian thực, nên dùng các mẫu Matrix 220 có bộ lọc YAG để tránh làm cháy cảm biến CMOS." },
  { "data": "Các mẫu hỗ trợ Digimarc Barcode gồm mã 937900017 (1.2MP STD-R 7mm HP) và 937900018 (1.2MP STD-R 12mm HP)." },
  { "data": "Digimarc Barcode là công nghệ mã hóa GTIN vào đồ họa trước khi in để phân bố dư thừa trên bao bì, giúp thu nhận dễ dàng mà không ảnh hưởng thiết kế (GS1 gọi là DWCODE™)." },
  { "data": "HDR tăng cường giá trị pixel có cường độ thấp để cải thiện độ tương phản ảnh và khả năng đọc mã." },
  { "data": "HDR hữu ích khi vùng ngoài ảnh kém phơi sáng so với tâm do góc nghiêng lớn, vì HDR điều chỉnh độ tương phản để cải thiện giải mã." },
  { "data": "HDR giúp đối phó sự không đồng đều độ tương phản của illuminator DPM ở khoảng cách ngắn (ví dụ 50 mm) bằng cách chuẩn hoá độ tương phản và cho phép dùng cài đặt Standard Contrast." },
  { "data": "Khi các mã trong FoV có độ tương phản khác nhau, bật HDR có thể nâng số mã giải được (ví dụ từ 2/4 lên 4/4 trong ví dụ)." },
  { "data": "Bật HDR cho phép giảm thời gian phơi sáng, từ đó tăng tốc độ băng chuyền tối đa; nguyên tắc là Texp < X/LS (độ phân giải mã chia cho tốc độ băng chuyền)." },
  { "data": "Ví dụ tham khảo: không HDR Texp 250 µs cho ~1320 mm/s; với HDR Texp 100 µs cho ~3300 mm/s cho C128 13 mil ở 200 mm (giá trị ví dụ)." },
  { "data": "Để bật HDR trong DL.CODE, vào Advanced Setup > Image Settings > Image Quality > HDR Selector và chọn 'HDR'." },
  { "data": "Khi bật HDR nên đặt Gain Multiplier là x1." },
  { "data": "Mẫu Matrix 220 cho ứng dụng huỳnh quang UV là Matrix 220 3U2-01U 1.2MP STD-UV 7MM HP." },
  { "data": "Đèn UV nội bộ phát chủ yếu ở bước sóng 365 nm; nên dùng mực nhạy với bước sóng này." },
  { "data": "Bộ lọc quang học đi kèm là Long Pass 415 nm đặt trước ống kính, cho phép truyền các bước sóng trên 415 nm và suy giảm tia UV." },
  { "data": "Vì phát xạ huỳnh quang UV thường yếu nên cần tăng Gain Multiplier, đặc biệt trong ứng dụng động với chế độ chiếu Very High Power." },
  { "data": "Chế độ chiếu sáng được khuyến nghị cho ứng dụng UV tĩnh hoặc bán tĩnh là High Power-Strobed." },
  { "data": "Sơ đồ đọc tiêu chuẩn không áp dụng cho mẫu UV; hiệu năng UV phụ thuộc vào mực và bề mặt nên cần thử nghiệm với mẫu thực tế." },
  { "data": "Ghi chú an toàn cho UV: tham khảo phần LED Safety (trang tham chiếu)." },
  { "data": "Khi mở hộp nên có: đầu đọc Matrix 220 (với nắp/đầu nối), Hướng dẫn nhanh, Test Chart, Bộ phụ kiện gắn, hai ốc vít, hai vòng đệm và một gá lắp." },
  { "data": "Khi không sử dụng Ethernet trên các mẫu Ethernet, có nắp đầu nối kín giữ bảo vệ IP67 cho cổng Ethernet." },
  { "data": "Trên mẫu PoE, nắp che cổng COM/Trigger cung cấp bảo vệ khi không sử dụng." }
]